dataset_gen/OpenFoam_Shapes/Square/design_points/design_point_2/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
9600
(
(-0.94532445 -7.4747821 0.5)
(-0.69812629 -7.4747821 0.5)
(-0.45092812 -7.4747821 0.5)
(-0.20372995 -7.4747821 0.5)
(0.043468212 -7.4747821 0.5)
(0.29066638 -7.4747821 0.5)
(0.53786455 -7.4747821 0.5)
(0.78506271 -7.4747821 0.5)
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(3.3875398 -5.4748845 0.5)
(3.4125398 -5.4748845 0.5)
(3.4375398 -5.4748845 0.5)
(3.4625398 -5.4748845 0.5)
(3.4875398 -5.4748845 0.5)
(3.5125398 -5.4748845 0.5)
(3.5375398 -5.4748845 0.5)
(3.5625398 -5.4748845 0.5)
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.9999602 -7.5 0.5)
(-0.7499602 -7.5 0.5)
(-0.4999602 -7.5 0.5)
(-0.2499602 -7.5 0.5)
(3.98e-05 -7.5 0.5)
(0.2500398 -7.5 0.5)
(0.5000398 -7.5 0.5)
(0.7500398 -7.5 0.5)
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(8.7500398 7.5 0.5)
(8.5000398 7.5 0.5)
(8.2500398 7.5 0.5)
(8.0000398 7.5 0.5)
(7.7500398 7.5 0.5)
(7.5000398 7.5 0.5)
(7.2500398 7.5 0.5)
(7.0000398 7.5 0.5)
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(-15 7.3125 0.5)
(-15 6.9375 0.5)
(-15 6.5625 0.5)
(-15 6.1875 0.5)
(-15 5.8125 0.5)
(-15 5.4375 0.5)
(-15 5.0625 0.5)
(-15 4.6875 0.5)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(15 -7.3125 0.5)
(15 -6.9375 0.5)
(15 -6.5625 0.5)
(15 -6.1875 0.5)
(15 -5.8125 0.5)
(15 -5.4375 0.5)
(15 -5.0625 0.5)
(15 -4.6875 0.5)
...
)
;
    }
}


// ************************************************************************* //
