dataset_gen/OpenFoam_Shapes/Square/design_points/design_point_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    FrontBack
    {
        type		empty;
        nFaces		19200;
        startFace		18960;
    }
    Cylinder
    {
        type		wall;
        nFaces		160;
        startFace		38160;
    }
    Bottom
    {
        type		wall;
        nFaces		120;
        startFace		38320;
    }
    Top
    {
        type		wall;
        nFaces		120;
        startFace		38440;
    }
    Inlet
    {
        type		patch;
        nFaces		40;
        startFace		38560;
    }
    Outlet
    {
        type		patch;
        nFaces		40;
        startFace		38600;
    }
)

// ************************************************************************* //
